Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
                <register>
                    <name>R32_PIN_CONFIG2</name>
                    <description>RW, Pin configuration register 2</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_PIN_PA_DIS[4:15]</name>
                            <description>RW, PA4-PA15 channel pin digital input enable</description>
                            <bitRange>[15:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PB_DIS[0]</name>
                            <description>RW, PB0 channel pin digital input enable</description>
                            <bitRange>[16:16]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PB_DIS[4]</name>
                            <description>RW, PB4 channel pin digital input enable</description>
                            <bitRange>[20:20]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PB_DIS[6:7]</name>
                            <description>RW, PB6-PB7 channel pin digital input enable</description>
                            <bitRange>[23:22]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PB_DIS[8:9]</name>
                            <description>RW, PB22-PB23 channel pin digital input enable</description>
                            <bitRange>[25:24]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_PB_DIS[10:15]</name>
                            <description>RW, PB10-PB15 channel pin digital input enable</description>
                            <bitRange>[31:26]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_POWER_PLAN</name>
                    <description>RWA, power plan before sleep instruction, SAM</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x31DF</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWR_XROM</name>
                            <description>RWA, power for FlashROM</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_RAM2K</name>
                            <description>RWA, SRAM power supply for RAM2K</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_CORE</name>
                            <description>RWA, power retention for core and base peripherals</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_EXTEND</name>
                            <description>RWA, power retention for USB and BLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_RAM24K</name>
                            <description>RWA, SRAM power supply for RAM24K</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_MAIN_ACT</name>
                            <description>RWA, Main power selection</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_SYS_EN</name>
                            <description>RWA, power for system</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_LDO_EN</name>
                            <description>RWA, Internal LDO control</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_EN</name>
                            <description>RWA, DC/DC converter enable</description>
                            <bitRange>[9:9]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_DCDC_PRE</name>
                            <description>RWA, DC/DC converter pre-enable</description>
                            <bitRange>[10:10]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>Reserved</name>
                            <description>RWA, retain. Must write 1.</description>
                            <bitRange>[13:13]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_PLAN_EN</name>
                            <description>RWA, must write 0010</description>
                            <bitRange>[15:15]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_AUX_POWER_ADJ</name>
                    <description>RWA, aux power adjust control, SAM</description>
                    <addressOffset>0x22</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0XXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_ULPLDO_ADJ</name>
                            <description>RWA, Output voltage regulation value of auxiliary power supply for ultra-low power consumption LDO</description>
                            <bitRange>[2:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_DCDC_CHARGE</name>
                            <description>RWA, Low power auxiliary DC-DC enable bit</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CFG_IVREF</name>
                            <description>RWA, retain. The original value must be kept unchanged when writing</description>
                            <bitRange>[11:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_IB_TKEY_SEL</name>
                            <description>RWA, TouchKey bias current, used to stabilize I/O potential and prevent accidental wake-up</description>
                            <bitRange>[15:14]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CTRL</name>
                    <description>RWA, battery voltage detector control, SAM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_DET_EN</name>
                            <description>RWA, When RB_BAT_MON_EN=0, it is enabled by high-precision battery voltage detection function</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_VTHX</name>
                            <description>RWA, When RB_BAT_MON_EN=1, set low power consumption</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOWER_IE</name>
                            <description>RWA, interrupt enable for battery lower voltage</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_IE</name>
                            <description>RWA, interrupt enable for battery low voltage</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CFG</name>
                    <description>RWA, battery voltage detector configuration, SAM</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_LOW_VTH</name>
                            <description>RWA, select threshold voltage of battery voltage low</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_STATUS</name>
                    <description>RO, battery status</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_STAT_LOWER</name>
                            <description>RO, battery lower voltage status, high action</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_BAT_STAT_LOW</name>
                            <description>RO, battery low voltage status, high action</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_INT32K_TUNE</name>
                    <description>RWA, internal 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x1011</resetValue>
                    <fields>
                        <field>
                            <name>RB_INT32K_TUNE</name>
                            <description>RWA, internal 32KHz oscillator frequency tune</description>
                            <bitRange>[12:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_XT32K_TUNE</name>
                    <description>RWA, External 32KHz oscillator tune control, SAM</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xC3</resetValue>
                    <fields>
                        <field>
                            <name>RB_XT32K_I_TUNE</name>
                            <description>RWA, External 32KHz oscillator bias current selection</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_XT32K_C_LOAD</name>
                            <description>RWA, External 32KHz oscillator load capacitor tune: Cap = RB_XT32K_C_LOAD + 12pF</description>
                            <bitRange>[7:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_CK32K_CONFIG</name>
                    <description>RWA, 32KHz oscillator configure</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xX2</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_XT32K_PON</name>
                            <description>RWA, external 32KHz oscillator power on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_INT32K_PON</name>
                            <description>RWA, internal 32KHz oscillator power on</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_XT</name>
                            <description>RWA, 32KHz oscillator source selection: 0=RC, 1=XT</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OSC32K_FILT</name>
                            <description>RWA, internal 32KHz oscillator low noise mode enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_32K_CLK_PIN</name>
                            <description>RO, 32KHz oscillator clock pin status</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
