Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
            </registers>    
        </peripheral>
        <peripheral>
            <name>TouchKey</name>
            <description>Touch buttons</description>
            <groupName>TouchKey</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x54</offset>
                <size>0x03</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>R8_TKEY_COUNT</name>
                    <description>RW, Touchkey charge and discharge count</description>
                    <addressOffset>0x54</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_CHARG_CNT</name>
                            <description>RW, Touchkey charge count</description>
                            <bitRange>[4:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_DISCH_CNT</name>
                            <description>RW, Touchkey discharge count</description>
                            <bitRange>[7:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TKEY_CONVERT</name>
                    <description>RW, Touchkey convert start control</description>
                    <addressOffset>0x56</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_START</name>
                            <description>RW, Touchkey convert start control</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TKEY_CFG</name>
                    <description>RW, Touchkey configure</description>
                    <addressOffset>0x57</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TKEY_PWR_ON</name>
                            <description>RW, Touchkey power on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_CURRENT</name>
                            <description>R0, Touchkey charge current selection</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_TKEY_DRV_EN</name>
                            <description>RW, Touchkey drive shield enable</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_PGA_ADJ</name>
                            <description>RW, ADC input PGA speed selection</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_DMA_EN</name>
                            <description>RW, TouchKey DMA Enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_AUTO_EN</name>
                            <description>RW, TouchKey automatic trigger enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_TKEY_RAND_EN</name>
                            <description>RW, TouchKey Trigger enable at will</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC</name>
            <description>Analog to Digital Converter</description>
            <groupName>ADC</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x58</offset>
                <size>0x36</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC</name>
                <description>ADC_IRQHandler</description>
                <value>29</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_ADC_CHANNEL</name>
                    <description>RW, ADC input channel selection</description>
                    <addressOffset>0x58</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x0F</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_CH_INX</name>
                            <description>RW, ADC input channel index</description>
                            <bitRange>[3:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CFG</name>
                    <description>RW, ADC configure</description>
                    <addressOffset>0x59</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xA0</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_POWER_ON</name>
                            <description>RW, ADC power control: 0=power down, 1=power on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_BUF_EN</name>
                            <description>RW, ADC input buffer enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_DIFF_EN</name>
                            <description>RW, ADC input channel mode: 0=single-end, 1=differnetial</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_OFS_TEST</name>
                            <description>RW, enable ADC offset test mode: 0=normal mode, 1=short to test offset</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_PGA_GAIN[1:0]</name>
                            <description>RW, set ADC input PGA gain: 00=-12dB, 01=-6dB, 10=0dB, 11=6dB</description>
                            <bitRange>[5:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_CLK_DIV</name>
                            <description>RW, select ADC clock frequency: 00=3.2MHz, 01=2.67MHz, 10=5.33MHz, 11=4MHz</description>
                            <bitRange>[7:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CONVERT</name>
                    <description>RW, ADC convert control</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_START</name>
                            <description>RW, ADC convert start control: 0=stop ADC convert, 1=start an ADC convert, auto clear</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ADC_PGA_GAIN[2]</name>
                            <description>RW, ADC input PGA gain direction selection, combined with RB_ ADC_ PGA_ GAIN [1:0] usage</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>                        
                        <field>
                            <name>RB_ADC_EOC_X</name>
                            <description>RO, end of ADC conversion flag</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_TEM_SENSOR</name>
                    <description>RW, temperature sensor control</description>
                    <addressOffset>0x5B</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_TEM_SEN_PWR_ON</name>
                            <description>RW, temperature sensor power control: 0=power down, 1=power on</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DATA</name>
                    <description>RO, ADC data</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0x0XXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_DATA</name>
                            <description>RO, ADC conversion data</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_INT_FLAG</name>
                    <description>RO, ADC interrupt flag register</description>
                    <addressOffset>0x5E</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_IF_EOC</name>
                            <description>RO, ADC conversion interrupt flag</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_CTRL_DMA</name>
                    <description>RW, ADC DMA control</description>
                    <addressOffset>0x61</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_DMA_ENABLE</name>
                            <description>RW, ADC DMA enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_DMA_LOOP</name>
                            <description>RW, ADC DMA address loop enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IE_DMA_END</name>
                            <description>RW, enable interrupt for ADC DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IE_EOC</name>
                            <description>RW, enable interrupt for end of ADC conversion</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_CONT_EN</name>
                            <description>RW, enable contineous conversion ADC</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_AUTO_EN</name>
                            <description>RW, enable auto continuing ADC for DMA</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_DMA_IF</name>
                    <description>RW1, ADC and DMA interrupt flag registers</description>
                    <addressOffset>0x62</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_ADC_IF_DMA_END</name>
                            <description>interrupt flag for ADC DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_ADC_IF_END_ADC</name>
                            <description>interrupt flag for end of ADC conversion</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ADC_AUTO_CYCLE</name>
                    <description>RO, ADC interrupt flag</description>
                    <addressOffset>0x63</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_ADC_AUTO_CYCLE</name>
                            <description>auto ADC cycle value, unit is 16 Fsys</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_NOW</name>
                    <description>RO, ADC DMA current address</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_NOW</name>
                            <description>ADC DMA current address</description>
                            <bitRange>[14:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_BEG</name>
                    <description>RW, ADC DMA begin address</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_BEG</name>
                            <description>ADC DMA begin address</description>
                            <bitRange>[14:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_ADC_DMA_END</name>
                    <description>RW, ADC DMA end address</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_ADC_DMA_END</name>
                            <description>ADC DMA end address</description>
                            <bitRange>[14:1]</bitRange>
                        </field>
                    </fields>
                </register>
