Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIO</name>
            <description>General porpose intput output</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x90</offset>
                <size>0x48</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GPIOA</name>
                <description>GPIOA_IRQHandler</description>
                <value>17</value>
            </interrupt>
            <interrupt>
                <name>GPIOB</name>
                <description>GPIOB_IRQHandler</description>
                <value>18</value>
            </interrupt>            
            <registers>
                <register>
                    <name>R16_PA_INT_EN</name>
                    <description>RW, GPIO PA interrupt enable</description>
                    <addressOffset>0x90</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_EN</name>
                            <description>GPIO PA interrupt enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_EN</name>
                    <description>RW, GPIO PB interrupt enable</description>
                    <addressOffset>0x92</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_EN</name>
                            <description> GPIO PB interrupt enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_MODE</name>
                    <description>RW, GPIO PA interrupt mode: 0=level action, 1=edge action</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_MODE</name>
                            <description>  GPIO PA interrupt mode</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_MODE</name>
                    <description>RW, GPIO PB interrupt mode: 0=level action, 1=edge action;RW, status for parallel slave read</description>
                    <addressOffset>0x96</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_MODE</name>
                            <description> GPIO PB interrupt mode</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_IF</name>
                    <description>RW1, GPIO PA interrupt flag</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_IF</name>
                            <description> GPIO PA interrupt flag</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PB_INT_IF</name>
                    <description>RW1, GPIO PB interrupt flag</description>
                    <addressOffset>0x9E</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PB_INT_IF</name>
                            <description>  GPIO PB interrupt flag</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_DIR</name>
                    <description>RW, GPIO PA I/O direction: 0=in, 1=out</description>
                    <size>32</size>
                    <addressOffset>0xA0</addressOffset>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_DIR_0</name>
                            <description> GPIO PA I/O direction byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_DIR_1</name>
                            <description> GPIO PA I/O direction byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PIN</name>
                    <description>RO, GPIO PA input</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000XXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PIN_0</name>
                            <description>GPIO PA input byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PIN_1</name>
                            <description>GPIO PA input byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_OUT</name>
                    <description>RW, GPIO PA output</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_OUT_0</name>
                            <description>GPIO PA output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_OUT_1</name>
                            <description>GPIO PA output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_CLR</name>
                    <description>WZ, GPIO PA clear output: 0=keep, 1=clear</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>Write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_CLR_0</name>
                            <description>GPIO PA clear output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_CLR_1</name>
                            <description>GPIO PA clear output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PU</name>
                    <description>RW, GPIO PA pullup resistance enable</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PU_0</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PU_1</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PD_DRV</name>
                    <description>RW, PA pulldown for input or PA driving capability for output</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PD_DRV_0</name>
                            <description>PA pulldown for input or PA driving capability for output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PD_DRV_1</name>
                            <description>PA pulldown for input or PA driving capability for output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_DIR</name>
                    <description>RW, GPIO PB I/O direction: 0=in, 1=out</description>
                    <addressOffset>0xC0</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_DIR_0</name>
                            <description>GPIO PB I/O direction byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_DIR_1</name>
                            <description>GPIO PB I/O direction byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_DIR_2</name>
                            <description>GPIO PB I/O direction byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PIN</name>
                    <description>RO, GPIO PB input</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PIN_0</name>
                            <description> GPIO PB input byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PIN_1</name>
                            <description> GPIO PB input byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PIN_2</name>
                            <description> GPIO PB input byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_OUT</name>
                    <description>RW, GPIO PB output;RW, data for parallel slave read</description>
                    <addressOffset>0xC8</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_OUT_0</name>
                            <description>GPIO PB output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_OUT_1</name>
                            <description>GPIO PB output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_OUT_2</name>
                            <description>GPIO PB output byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_CLR</name>
                    <description>WZ, GPIO PB clear output: 0=keep, 1=clear</description>
                    <addressOffset>0xCC</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_CLR_0</name>
                            <description>GPIO PB clear output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_CLR_1</name>
                            <description>GPIO PB clear output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_CLR_2</name>
                            <description>GPIO PB clear output byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PU</name>
                    <description>RW, GPIO PB pullup resistance enable</description>
                    <addressOffset>0xD0</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PU_0</name>
                            <description>GPIO PB pullup resistance enable byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PU_1</name>
                            <description>GPIO PB pullup resistance enable byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PU_2</name>
                            <description>GPIO PB pullup resistance enable byte 2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PB_PD_DRV</name>
                    <description>RW, PB pulldown for input or PB driving capability for output</description>
                    <addressOffset>0xD4</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PB_PD_DRV_0</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PD_DRV_1</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PB_PD_DRV_2</name>
                            <description>PB pulldown for input or PB driving capability for output byte 0</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                    </fields>
                </register>
