Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
                <register>
                    <name>R16_UEP0_DMA</name>
                    <description>endpoint 0 DMA buffer address</description>
                    <addressOffset>0x10</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP0_DMA</name>
                            <description>RW,endpoint 0 DMA buffer address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP1_DMA</name>
                    <description>endpoint 1 DMA buffer address</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP1_DMA</name>
                            <description>RW,endpoint 1 DMA buffer address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP2_DMA</name>
                    <description>endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP2_DMA</name>
                            <description>RW,endpoint 2 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP3_DMA</name>
                    <description>endpoint 3 DMA buffer address;host tx endpoint buffer high address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP3_DMA</name>
                            <description>RW,endpoint 3 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP5_DMA</name>
                    <description>endpoint 5 DMA buffer address</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP5_DMA</name>
                            <description>RW,endpoint 5 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP6_DMA</name>
                    <description>endpoint 6 DMA buffer address</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP6_DMA</name>
                            <description>RW,endpoint 6 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_UEP7_DMA</name>
                    <description>endpoint 7 DMA buffer address</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_UEP7_DMA</name>
                            <description>RW,endpoint 7 DMA buffer address;host rx endpoint buffer high address</description>
                            <bitRange>[14:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP0_T_LEN</name>
                    <description>endpoint 0 transmittal length</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP0_T_LEN</name>
                            <description>endpoint 0 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP0_CTRL</name>
                    <description>endpoint 0 control</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP1_T_LEN</name>
                    <description>endpoint 1 transmittal length</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP1_T_LEN</name>
                            <description>endpoint 1 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP1_CTRL</name>
                    <description>endpoint 1 control;host aux setup</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1;USB host automatic SOF enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;RB_UH_PRE_PID_EN;USB host PRE PID enable for low speed device via hub</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP2_T_LEN</name>
                    <description>endpoint 2 transmittal length;host endpoint and PID</description>
                    <addressOffset>0x28</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP2_T_LEN</name>
                            <description>Set the number of data bytes to be sent by USB endpoint n</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_UEP2_HOST_PID3</name>
                            <description>The token in host mode identifies the bit3 of the PID</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP2_CTRL</name>
                    <description>endpoint 2 control;host receiver endpoint control</description>
                    <addressOffset>0x2A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UH_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle;enable automatic toggle after successful transfer completion: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1;expected data toggle flag of host receiving (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP3_T_LEN</name>
                    <description>endpoint 3 transmittal length;host transmittal endpoint transmittal length</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP3_T_LEN</name>
                            <description>endpoint 1 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP3_CTRL</name>
                    <description>endpoint 3 control;host transmittal endpoint control</description>
                    <addressOffset>0x2E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP4_T_LEN</name>
                    <description>endpoint 4 transmittal length</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP4_T_LEN</name>
                            <description>endpoint 4 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP4_CTRL</name>
                    <description>endpoint 4 control</description>
                    <addressOffset>0x32</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP5_T_LEN</name>
                    <description>endpoint 5 transmittal length</description>
                    <addressOffset>0x64</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP5_T_LEN</name>
                            <description>endpoint 5 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP5_CTRL</name>
                    <description>endpoint 5 control</description>
                    <addressOffset>0x66</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP6_T_LEN</name>
                    <description>endpoint 6 transmittal length</description>
                    <addressOffset>0x68</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP6_T_LEN</name>
                            <description>endpoint 6 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
