Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
                <register>
                    <name>R8_UEP6_CTRL</name>
                    <description>endpoint 6 control</description>
                    <addressOffset>0x6A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP7_T_LEN</name>
                    <description>endpoint 7 transmittal length</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_UEP7_T_LEN</name>
                            <description>endpoint 7 transmittal length</description>
                            <bitRange>[6:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_UEP7_CTRL</name>
                    <description>endpoint 7 control</description>
                    <addressOffset>0x6E</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>MASK_UEP_T_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X transmittal (IN)</description>
                            <bitRange>[1:0]</bitRange>
                        </field>
                        <field>
                            <name>MASK_UEP_R_RES</name>
                            <description>bit mask of handshake response type for USB endpoint X receiving (OUT)</description>
                            <bitRange>[3:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_AUTO_TOG</name>
                            <description>enable automatic toggle after successful transfer completion on endpoint 1_2_3: 0=manual toggle, 1=automatic toggle</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_T_TOG</name>
                            <description>prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_UEP_R_TOG</name>
                            <description>expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>BLE</name>
            <description>BLE register</description>
            <groupName>BLE</groupName>
            <baseAddress>0x4000C000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x1400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BLEL</name>
                <description>LLE_IRQHandler</description>
                <value>21</value>
            </interrupt>
            <interrupt>
                <name>BLEB</name>
                <description>BB_IRQHandler</description>
                <value>20</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>PFIC</name>
            <description>Program Fast Interrupt Controller</description>
            <groupName>PFIC</groupName>
            <baseAddress>0xE000E000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>R32_PFIC_ISR1</name>
                    <displayName>ISR1</displayName>
                    <description>RO,Interrupt Status Register 1</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000000C</resetValue>
                    <fields>
                        <field>
                            <name>INTENSTA</name>
                            <description>Interrupt ID Status</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_ISR2</name>
                    <displayName>ISR2</displayName>
                    <description>RO,Interrupt Status Register 2</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTENSTA</name>
                            <description>Interrupt ID Status</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPR1</name>
                    <displayName>IPR1</displayName>
                    <description>RO,Interrupt Pending Register 1</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDSTA</name>
                            <description>PENDSTA</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPR2</name>
                    <displayName>IPR2</displayName>
                    <description>RO,Interrupt Pending Register 2</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDSTA</name>
                            <description>PENDSTA</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_ITHRESDR</name>
                    <displayName>ITHRESDR</displayName>
                    <description>RW,Interrupt Priority Register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>THRESHOLD</name>
                            <description>RW,THRESHOLD</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_CFGR</name>
                    <displayName>CFGR</displayName>
                    <description>Interrupt Config Register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RESETSYS</name>
                            <description>WO,RESETSYS</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                        <field>
                            <name>KEYCODE</name>
                            <description>WO,KEYCODE</description>
                            <bitRange>[31:16]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_GISR</name>
                    <displayName>GISR</displayName>
                    <description>Interrupt Global Register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NESTSTA</name>
                            <description>RO,NESTSTA</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>GACTSTA</name>
                            <description>RO,GACTSTA</description>
                            <bitRange>[8:8]</bitRange>
                        </field>
                        <field>
                            <name>GPENDSTA</name>
                            <description>RO,GPENDSTA</description>
                            <bitRange>[9:9]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IDCFGR</name>
                    <displayName>IDCFGR</displayName>
                    <description>RW,Interrupt Fast ID Config Register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FIID0</name>
                            <description>RW,FIID0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>FIID1</name>
                            <description>RW,FIID1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>FIID2</name>
                            <description>RW,FIID2</description>
                            <bitRange>[23:16]</bitRange>
                        </field>
                        <field>
                            <name>FIID3</name>
                            <description>RW,FIID3</description>
                            <bitRange>[31:24]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_FIADDRR0</name>
                    <displayName>FIADDRR0</displayName>
                    <description>Interrupt 0 address Register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR0</name>
                            <description>RW,ADDR0</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                        <field>
                            <name>FI0EN</name>
                            <description>RW,Fast interrupt channel 0 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_FIADDRR1</name>
                    <displayName>FIADDRR1</displayName>
                    <description>Interrupt 1 address Register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR1</name>
                            <description>RW,ADDR1</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                        <field>
                            <name>FI1EN</name>
                            <description>RW,Fast interrupt channel 1 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_FIADDRR2</name>
                    <displayName>FIADDRR2</displayName>
                    <description>Interrupt 2 address Register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR2</name>
                            <description>RW,ADDR2</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                        <field>
                            <name>FI2EN</name>
                            <description>RW,Fast interrupt channel 2 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_FIADDRR3</name>
                    <displayName>FIADDRR3</displayName>
                    <description>Interrupt 3 address Register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ADDR3</name>
                            <description>RW,ADDR3</description>
                            <bitRange>[31:1]</bitRange>
                        </field>
                        <field>
                            <name>FI3EN</name>
                            <description>RW,Fast interrupt channel 3 enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IENR1</name>
                    <displayName>IENR1</displayName>
                    <description>Interrupt Setting Register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>RW1,INTEN</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IENR2</name>
                    <displayName>IENR2</displayName>
                    <description>Interrupt Setting Register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>RW1,INTEN</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IRER1</name>
                    <displayName>IRER1</displayName>
                    <description>Interrupt Clear Register</description>
                    <addressOffset>0x180</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTRESET</name>
                            <description>RW1,INTRESET</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IRER2</name>
                    <displayName>IRER2</displayName>
                    <description>Interrupt Clear Register</description>
                    <addressOffset>0x184</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTRESET</name>
                            <description>RW1,INTRESET</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPSR1</name>
                    <displayName>IPSR1</displayName>
                    <description>Interrupt Pending Register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDSET</name>
                            <description>RW1,PENDSET</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPSR2</name>
                    <displayName>IPSR2</displayName>
                    <description>Interrupt Pending Register</description>
                    <addressOffset>0x204</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDSET</name>
                            <description>RW1,PENDSET</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRR1</name>
                    <displayName>IPRR1</displayName>
                    <description>Interrupt Pending Clear Register</description>
                    <addressOffset>0x280</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDRESET</name>
                            <description>RW1,PENDRESET</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRR2</name>
                    <displayName>IPRR2</displayName>
                    <description>Interrupt Pending Clear Register</description>
                    <addressOffset>0x284</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PENDRESET</name>
                            <description>RW1,PENDRESET</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IACTR1</name>
                    <displayName>IACTR1</displayName>
                    <description>Interrupt ACTIVE Register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IACTS</name>
                            <description>RW1,IACTS</description>
                            <bitRange>[31:12]</bitRange>
                        </field>
                    </fields>
                </register>
