Community-PIO-CH32V/platform-ch32v/misc/svd/CH592.svd
                <register>
                    <name>R32_PFIC_IPRIOR29</name>
                    <displayName>IPRIOR29</displayName>
                    <description>Interrupt Priority configuration Register  29</description>
                    <addressOffset>0x7A0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR29</name>
                            <description>RW,Interrupt priority for number 116-119</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR30</name>
                    <displayName>IPRIOR30</displayName>
                    <description>Interrupt Priority configuration Register 30</description>
                    <addressOffset>0x7C0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR30</name>
                            <description>RW,Interrupt priority for number 120-123</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR31</name>
                    <displayName>IPRIOR31</displayName>
                    <description>Interrupt Priority configuration Register 31</description>
                    <addressOffset>0x7E0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR31</name>
                            <description>RW,Interrupt priority for number 124-127</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR32</name>
                    <displayName>IPRIOR32</displayName>
                    <description>Interrupt Priority configuration Register 32</description>
                    <addressOffset>0x800</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR32</name>
                            <description>RW,Interrupt priority for number 128-131</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR33</name>
                    <displayName>IPRIOR33</displayName>
                    <description>Interrupt Priority configuration Register 33</description>
                    <addressOffset>0x820</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR33</name>
                            <description>RW,Interrupt priority for number 132-135</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR34</name>
                    <displayName>IPRIOR34</displayName>
                    <description>Interrupt Priority configuration Register 34</description>
                    <addressOffset>0x840</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR34</name>
                            <description>RW,Interrupt priority for number 136-139</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR35</name>
                    <displayName>IPRIOR35</displayName>
                    <description>Interrupt Priority configuration Register 35</description>
                    <addressOffset>0x860</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR35</name>
                            <description>RW,Interrupt priority for number 140-143</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR36</name>
                    <displayName>IPRIOR36</displayName>
                    <description>Interrupt Priority configuration Register 36</description>
                    <addressOffset>0x880</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR36</name>
                            <description>RW,Interrupt priority for number 144-147</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR37</name>
                    <displayName>IPRIOR37</displayName>
                    <description>Interrupt Priority configuration Register 37</description>
                    <addressOffset>0x8A0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR37</name>
                            <description>RW,Interrupt priority for number 148-151</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR38</name>
                    <displayName>IPRIOR38</displayName>
                    <description>Interrupt Priority configuration Register 38</description>
                    <addressOffset>0x8C0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR38</name>
                            <description>RW,Interrupt priority for number 152-155</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR39</name>
                    <displayName>IPRIOR39</displayName>
                    <description>Interrupt Priority configuration Register 39</description>
                    <addressOffset>0x8E0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR39</name>
                            <description>RW,Interrupt priority for number 156-159</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR40</name>
                    <displayName>IPRIOR40</displayName>
                    <description>Interrupt Priority configuration Register 40</description>
                    <addressOffset>0x900</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR40</name>
                            <description>RW,Interrupt priority for number 160-163</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR41</name>
                    <displayName>IPRIOR41</displayName>
                    <description>Interrupt Priority configuration Register 41</description>
                    <addressOffset>0x920</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR41</name>
                            <description>RW,Interrupt priority for number 164-167</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR42</name>
                    <displayName>IPRIOR42</displayName>
                    <description>Interrupt Priority configuration Register 42</description>
                    <addressOffset>0x940</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR42</name>
                            <description>RW,Interrupt priority for number 168-171</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR43</name>
                    <displayName>IPRIOR43</displayName>
                    <description>Interrupt Priority configuration Register 43</description>
                    <addressOffset>0x960</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR43</name>
                            <description>RW,Interrupt priority for number 172-175</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR44</name>
                    <displayName>IPRIOR44</displayName>
                    <description>Interrupt Priority configuration Register 44</description>
                    <addressOffset>0x980</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR44</name>
                            <description>RW,Interrupt priority for number 176-179</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR45</name>
                    <displayName>IPRIOR45</displayName>
                    <description>Interrupt Priority configuration Register 45</description>
                    <addressOffset>0x9A0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR45</name>
                            <description>RW,Interrupt priority for number 180-183</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR46</name>
                    <displayName>IPRIOR46</displayName>
                    <description>Interrupt Priority configuration Register 46</description>
                    <addressOffset>0x9C0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR46</name>
                            <description>RW,Interrupt priority for number 184-187</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR47</name>
                    <displayName>IPRIOR47</displayName>
                    <description>Interrupt Priority configuration Register 47</description>
                    <addressOffset>0x9E0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR47</name>
                            <description>RW,Interrupt priority for number 188-191</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR48</name>
                    <displayName>IPRIOR48</displayName>
                    <description>Interrupt Priority configuration Register 48</description>
                    <addressOffset>0xA00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR48</name>
                            <description>RW,Interrupt priority for number 192-195</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR49</name>
                    <displayName>IPRIOR49</displayName>
                    <description>Interrupt Priority configuration Register 49</description>
                    <addressOffset>0xA20</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR49</name>
                            <description>RW,Interrupt priority for number 196-199</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR50</name>
                    <displayName>IPRIOR50</displayName>
                    <description>Interrupt Priority configuration Register 50</description>
                    <addressOffset>0xA40</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR50</name>
                            <description>RW,Interrupt priority for number 200-203</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR51</name>
                    <displayName>IPRIOR51</displayName>
                    <description>Interrupt Priority configuration Register 51</description>
                    <addressOffset>0xA60</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR51</name>
                            <description>RW,Interrupt priority for number 204-207</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR52</name>
                    <displayName>IPRIOR52</displayName>
                    <description>Interrupt Priority configuration Register 52</description>
                    <addressOffset>0xA80</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR52</name>
                            <description>RW,Interrupt priority for number 208-211</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR53</name>
                    <displayName>IPRIOR53</displayName>
                    <description>Interrupt Priority configuration Register 53</description>
                    <addressOffset>0xAA0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR53</name>
                            <description>RW,Interrupt priority for number 212-215</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR54</name>
                    <displayName>IPRIOR54</displayName>
                    <description>Interrupt Priority configuration Register 54</description>
                    <addressOffset>0xAD0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR54</name>
                            <description>RW,Interrupt priority for number 216-219</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR55</name>
                    <displayName>IPRIOR55</displayName>
                    <description>Interrupt Priority configuration Register 55</description>
                    <addressOffset>0xAE0</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR55</name>
                            <description>RW,Interrupt priority for number 220-223</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR56</name>
                    <displayName>IPRIOR56</displayName>
                    <description>Interrupt Priority configuration Register 56</description>
                    <addressOffset>0xB00</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR56</name>
                            <description>RW,Interrupt priority for number 224-227</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR57</name>
                    <displayName>IPRIOR57</displayName>
                    <description>Interrupt Priority configuration Register 57</description>
                    <addressOffset>0xB20</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR57</name>
                            <description>RW,Interrupt priority for number 228-231</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PFIC_IPRIOR58</name>
                    <displayName>IPRIOR58</displayName>
                    <description>Interrupt Priority configuration Register 58</description>
                    <addressOffset>0xB40</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>IPRIOR58</name>
                            <description>RW,Interrupt priority for number 232-235</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
